#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/zleetch/terraform-vpc-ali-development/runs/run-jScHDDbjrYKZRxsK

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.testing-vpc.alicloud_vpc.vpc will be created
  + resource "alicloud_vpc" "vpc" {
      + cidr_block        = "172.16.0.0/12"
      + id                = (known after apply)
      + ipv6_cidr_block   = (known after apply)
      + name              = (known after apply)
      + resource_group_id = (known after apply)
      + route_table_id    = (known after apply)
      + router_id         = (known after apply)
      + router_table_id   = (known after apply)
      + status            = (known after apply)
      + tags              = {
          + "Env"   = "terraform-vpc-ali-development"
          + "Name"  = "vpc-testing-vpc-terraform-vpc-ali-development"
          + "Runby" = "terraform"
          + "Team"  = "devops"
        }
      + vpc_name          = "vpc-testing-vpc-terraform-vpc-ali-development"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ALICLOUD_SECRET_KEY" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jScHDDbjrYKZRxsK/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ALICLOUD_ACCESS_KEY" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-jScHDDbjrYKZRxsK/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵
```
</details>
*Pusher: @zleetch, Action: `pull_request`*